In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('World')

+-------------+-----------+---------+------------+--------------+
|     name    | continent |   area  | population |     gdp      |
+-------------+-----------+---------+------------+--------------+
| Afghanistan |    Asia   |  652230 |  25500100  | 20343000000  |
|   Albania   |   Europe  |  28748  |  2831741   | 12960000000  |
|   Algeria   |   Africa  | 2381741 |  37100000  | 188681000000 |
|   Andorra   |   Europe  |   468   |   78115    |  3712000000  |
|    Angola   |   Africa  | 1246700 |  20609294  | 100990000000 |
+-------------+-----------+---------+------------+--------------+

### Write an SQL query to report the name, population, and area of the big countries.

*A country is big if:*
-  *it has an area of at least three million (i.e., 3000000 km2), or*
-  *it has a population of at least twenty-five million (i.e., 25000000).*

```
Output: 
+-------------+------------+---------+
| name        | population | area    |
+-------------+------------+---------+
| Afghanistan | 25500100   | 652230  |
| Algeria     | 37100000   | 2381741 |
+-------------+------------+---------+
```

In [3]:
%%sql 

SELECT
    name, population, area
FROM World
WHERE area >= 3000000 OR population >= 25000000

[('Afghanistan', 25500100, 652230), ('Algeria', 37100000, 2381741)]

# Using Pandas

In [4]:
query = %sql SELECT * FROM World # type: ignore 
df = query.DataFrame()
df

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [5]:
# using filter()
df.filter(items=['name', 'population', 'area']).loc[(df['population'] >= 25_000_000) | (df['area'] >= 3_000_000)]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [6]:
# using loc[]
df[['name', 'population', 'area']][(df['population'] >= 25_000_000) | (df['area'] >= 3_000_000)]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [7]:
# using query()
df.query("population >= 25_000_000 or area >= 3_000_000")[['name','population', 'area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [8]:
# drop index to match MySQL output
df.query("population >= 25_000_000 or area >= 3_000_000")[['name','population', 'area']]\
    .set_index(['name', 'population', 'area'], drop=True)

Empty DataFrame
Columns: []
Index: [(Afghanistan, 25500100, 652230), (Algeria, 37100000, 2381741)]

# Test Results

In [9]:
from mysql_query_lab.tests.test_countries import test_output

output = df.query("population >= 25_000_000 or area >= 3_000_000")[['name','population', 'area']]
try:
    test_output(output=output, df=df)
except AssertionError as e:
    print(e)

Test passed: Output matches the expected result.